// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// int WorkWithUser(string message)
// {
//     Console.Write(message);
//     int number=int.Parse(Console.ReadLine());
//     return number;
// }

// int Chislo_v_stepeni (int number_A, int number_B)
// {

// int Rank = 1;
// for (int i=1; i<=number_B; i++)
// {
//     Rank=Rank*number_A;
// }
// return Rank;
// }


// int number_A = WorkWithUser("Введите число которое нужно возвести в степень: ");
// int number_B = WorkWithUser("Введите степень: ");

// Console.Write(Chislo_v_stepeni(number_A, number_B));
